'''
Реализовать структуру данных «Товары». Она должна представлять собой список кортежей.
Каждый кортеж хранит информацию об отдельном товаре. В кортеже должно быть два элемента
 — номер товара и словарь с параметрами (характеристиками товара: название, цена,
 количество, единица измерения). Структуру нужно сформировать программно, т.е.
 запрашивать все данные у пользователя.
'''

product_1 = [1, 'плед', 2000, 6, 'шт.']
product_2 = [2, 'подушка', 1000, 10, 'пар']
product_3 = [3, 'одеяло', 4000, 3, 'шт.']
product_4 = [4, 'матрас', 8000, 2, 'шт.']
q = 1 # переменная для выхода из цикла
i = 1 # переменная для цикла
while q == 1:
    print('Хотите добавить продукт (да/нет)')
    input_answer = input()
    if input_answer == 'да':
        product = tuple()
        product = (i,)
        print('Введите характеристики товара через запятую '
              '(название, цена, количество, единица измерения)')
        product_name = (input())
        l = list(product) # l - вспомогательная переменная для добавления в кортеж список
        l.append(product_name)
        tuple(l)
        product = l
        all_products = product
        i = i + 1
    else:
        break
print(all_products)